In [24]:
# импортируем библиотеки
import pandas as pd
from sqlalchemy import create_engine

db_config = {'user': '****',         # имя пользователя
             'pwd': '****', # пароль
             'host': '****',
             'port': 5432,              # порт подключения
             'db': '****'}          # название базы данных

connection_string = 'postgresql://{}:{}@{}:{}/{}'.format(db_config['user'],
                                                                     db_config['pwd'],
                                                                       db_config['host'],
                                                                       db_config['port'],
                                                                       db_config['db'])

engine = create_engine(connection_string)

# 1. Посчитайте затраты на каждую рекламную кампанию.

In [32]:
query = '''
SELECT
    source_id,
    sum(costs) as sum
FROM 
    advertisment_costs
GROUP BY
    source_id
'''
pd.io.sql.read_sql(query, con = engine)

   source_id          sum
0         10    $5,822.49
1          9    $5,517.49
2          1   $20,833.27
3          5   $51,757.10
4          4   $61,073.60
5          2   $42,806.04
6          3  $141,321.63

# 2. Посчитайте суммарную выручку и размах (разницу между максимальным и минимальным значением) от заказов, сделанных с настольных ПК (тип устройства desktop).

In [33]:
query = '''
SELECT
    sum(revenue) AS sum,
    max(revenue) - min(revenue) AS scope
FROM 
    orders o left join visits v on o.Uid = v.UId
WHERE
    v.Device = 'desktop'
'''
pd.io.sql.read_sql(query, con = engine)

           sum      scope
0  $476,625.95  $2,633.28

# 3. Определите эффективность рекламной кампании в зависимости от категории устройства пользователя.

In [55]:
query = '''
WITH 
o AS (SELECT
    uid,
    buyts::date AS datets,
    sum(revenue) AS sum_r
FROM 
    orders
GROUP BY
    uid,
    buyts::date),
    
v AS (SELECT
    uid,
    device,
    sourceid,
    startts::date AS date_start,
    endts::date AS date_end
FROM 
    visits),

c AS (SELECT
    source_id,
    sum(costs) AS sum_coast,
    dt::date AS date_costs
FROM 
    advertisment_costs
GROUP BY
    source_id,
    dt::date)

SELECT
    c.date_costs AS date,
    o.sum_r - c.sum_coast AS efficiency
FROM
    v
LEFT JOIN o ON o.uid = v.uid AND o.datets = v.date_end
FULL OUTER JOIN c ON c.source_id = v.sourceid AND c.date_costs = v.date_end  
WHERE
    o.sum_r - c.sum_coast IS NOT NULL
ORDER BY
    date
'''
pd.io.sql.read_sql(query, con = engine)

            date efficiency
0     2017-06-01   -$126.46
1     2017-06-01    -$74.83
2     2017-06-01   -$347.30
3     2017-06-01    -$58.20
4     2017-06-01    -$70.98
5     2017-06-01   -$128.83
6     2017-06-01   -$131.34
7     2017-06-01   -$131.03
8     2017-06-01    -$73.98
9     2017-06-02    -$56.77
10    2017-06-02   -$131.40
11    2017-06-02   -$120.77
12    2017-06-02    -$57.38
13    2017-06-02   -$313.62
14    2017-06-02   -$130.55
15    2017-06-03     -$9.32
16    2017-06-03   -$195.97
17    2017-06-03    -$61.26
18    2017-06-04    -$51.67
19    2017-06-04    -$76.27
20    2017-06-04   -$153.90
21    2017-06-05    -$44.35
22    2017-06-05    -$25.15
23    2017-06-05    -$42.45
24    2017-06-05   -$106.76
25    2017-06-05   -$108.66
26    2017-06-05   -$106.64
27    2017-06-05   -$108.35
28    2017-06-05    -$24.24
29    2017-06-05   -$108.41
...          ...        ...
3487  2018-05-31   -$251.83
3488  2018-05-31   -$253.54
3489  2018-05-31   -$390.71
3490  2018-05-31   -$820.84
3491  2018-05-31   -$396.70
3492  2018-05-31   -$251.83
3493  2018-05-31   -$247.06
3494  2018-05-31   -$491.93
3495  2018-05-31   -$489.79
3496  2018-05-31    $148.88
3497  2018-05-31   -$396.76
3498  2018-05-31   -$821.81
3499  2018-05-31   -$135.90
3500  2018-05-31   -$485.94
3501  2018-05-31   -$245.35
3502  2018-05-31   -$247.43
3503  2018-05-31   -$490.28
3504  2018-05-31   -$249.75
3505  2018-05-31   -$819.55
3506  2018-05-31   -$785.63
3507  2018-05-31   -$389.49
3508  2018-05-31   -$246.82
3509  2018-05-31   -$488.14
3510  2018-05-31   -$253.42
3511  2018-05-31   -$394.37
3512  2018-05-31   -$240.40
3513  2018-05-31   -$250.48
3514  2018-05-31   -$246.82
3515  2018-05-31   -$249.75
3516  2018-05-31   -$394.99

[3517 rows x 2 columns]